#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/ambrosia-serve-k8s/ambrosia-serve-k8s/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/ambrosia-serve-k8s/ambrosia-serve-k8s

To view this run in a browser, visit:
https://app.terraform.io/app/ambrosia-serve/postech-workspace/runs/run-i8j3Lq46vADfDYxF

Waiting for the plan to start...

Terraform v1.10.1
on linux_amd64
Initializing plugins and modules...
data.aws_caller_identity.current: Refreshing...
aws_vpc.ambrosia_serve_vpc: Refreshing state... [id=vpc-0eb8ed8b878b508e9]
data.aws_caller_identity.current: Refresh complete after 0s [id=851725225519]
aws_subnet.subnet_private_b: Refreshing state... [id=subnet-01fb684cc1b1c4ab8]
aws_subnet.subnet_public_b: Refreshing state... [id=subnet-0eb2bcf80a0ec61b3]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d612c8a4923e502b]
aws_route_table.public: Refreshing state... [id=rtb-020a88326fc996ed0]
aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:851725225519:targetgroup/TG-ambrosia-serve/8de9f59412d6eba8]
aws_security_group.sg: Refreshing state... [id=sg-00ca0aaa461812dda]
aws_subnet.subnet_private_a: Refreshing state... [id=subnet-017c41224128ce5af]
aws_subnet.subnet_public_a: Refreshing state... [id=subnet-039ca420cbc5180a5]
aws_route_table.private_1: Refreshing state... [id=rtb-0962e81716229d87e]
aws_vpc_security_group_ingress_rule.allow_http_ipv4_80: Refreshing state... [id=sgr-0c4064600e86518b7]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv6: Refreshing state... [id=sgr-09391ccdc4350becd]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4: Refreshing state... [id=sgr-0efe4f6e36e6d0f17]
aws_eks_cluster.cluster: Refreshing state... [id=ambrosia-serve-cluster]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:851725225519:loadbalancer/app/production-alb/fba996c0d3e474a1]
aws_network_interface.default: Refreshing state... [id=eni-00c44ae65e31fa466]
aws_eip.elastic_ip: Refreshing state... [id=eipalloc-0048bcba420edea5b]
aws_eks_access_policy_association.voclabs_access_policy_association: Refreshing state... [id=ambrosia-serve-cluster#arn:aws:iam::851725225519:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_entry.eks_access_entry: Refreshing state... [id=ambrosia-serve-cluster:arn:aws:iam::851725225519:role/voclabs]
aws_eks_node_group.node_group: Refreshing state... [id=ambrosia-serve-cluster:ambrosia-serve]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:851725225519:listener/app/production-alb/fba996c0d3e474a1/04dc33a3eb0556fe]
aws_nat_gateway.nat_gw_public: Refreshing state... [id=nat-0e91e0b378267c8d9]
aws_nat_gateway.nat_gw_public: Drift detected (update)
aws_lb_target_group.tg: Drift detected (update)
aws_lb_listener.listener: Drift detected (update)
aws_eks_access_policy_association.voclabs_access_policy_association: Drift detected (update)
aws_security_group.sg: Drift detected (update)
aws_eks_node_group.node_group: Drift detected (update)
aws_eks_access_entry.eks_access_entry: Drift detected (update)
aws_eks_cluster.cluster: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-i8j3Lq46vADfDYxF/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-i8j3Lq46vADfDYxF/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_instance.ec2 will be read during apply
 <= data "aws_instance" "ec2" {
      + ami                         = (known after apply)
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + availability_zone           = (known after apply)
      + credit_specification        = (known after apply)
      + disable_api_stop            = (known after apply)
      + disable_api_termination     = (known after apply)
      + ebs_block_device            = (known after apply)
      + ebs_optimized               = (known after apply)
      + enclave_options             = (known after apply)
      + ephemeral_block_device      = (known after apply)
      + host_id                     = (known after apply)
      + host_resource_group_arn     = (known after apply)
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + instance_state              = (known after apply)
      + instance_tags               = (known after apply)
      + instance_type               = (known after apply)
      + ipv6_addresses              = (known after apply)
      + key_name                    = (known after apply)
      + launch_time                 = (known after apply)
      + maintenance_options         = (known after apply)
      + metadata_options            = (known after apply)
      + monitoring                  = (known after apply)
      + network_interface_id        = (known after apply)
      + outpost_arn                 = (known after apply)
      + password_data               = (known after apply)
      + placement_group             = (known after apply)
      + placement_partition_number  = (known after apply)
      + private_dns                 = (known after apply)
      + private_dns_name_options    = (known after apply)
      + private_ip                  = (known after apply)
      + public_dns                  = (known after apply)
      + public_ip                   = (known after apply)
      + root_block_device           = (known after apply)
      + secondary_private_ips       = (known after apply)
      + security_groups             = (known after apply)
      + source_dest_check           = (known after apply)
      + subnet_id                   = (known after apply)
      + tags                        = (known after apply)
      + tenancy                     = (known after apply)
      + user_data                   = (known after apply)
      + user_data_base64            = (known after apply)
      + vpc_security_group_ids      = (known after apply)

      + filter {
          + name   = "tag:eks:nodegroup-name"
          + values = [
              + "ambrosia-serve-node-group",
            ]
        }
    }

  # aws_eks_node_group.node_group must be replaced
-/+ resource "aws_eks_node_group" "node_group" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:851725225519:nodegroup/ambrosia-serve-cluster/ambrosia-serve/dac9f4e8-8e97-48a0-bab1-29ea34216cc9" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "ambrosia-serve-cluster:ambrosia-serve" -> (known after apply)
      ~ instance_types         = [
          - "t3.medium",
        ] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.31.3-20241213" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-ambrosia-serve-dac9f4e8-8e97-48a0-bab1-29ea34216cc9"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      ~ version                = "1.31" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.attach will be created
  + resource "aws_lb_target_group_attachment" "attach" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:851725225519:targetgroup/TG-ambrosia-serve/8de9f59412d6eba8"
      + target_id        = (known after apply)
    }

  # aws_nat_gateway.nat_gw_public must be replaced
-/+ resource "aws_nat_gateway" "nat_gw_public" {
      + association_id                     = (known after apply)
      ~ id                                 = "nat-0e91e0b378267c8d9" -> (known after apply)
      ~ network_interface_id               = "eni-04f394191372e7746" -> (known after apply)
      ~ private_ip                         = "10.0.4.181" -> (known after apply)
      + public_ip                          = (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
        tags                               = {
            "Name" = "ambrosia_serve_vpc-nat-public1-us-east-1a"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @felixrodrigo19, Action: `pull_request`, Working Directory: ``, Workflow: `CI - Infra`*